Revit 2027 API
ExternallyTaggedGeometryObject Properties
The ExternallyTaggedGeometryObject type exposes the following members.
Properties
Name | Description
ExternalId |  The external Id of the geometry object.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
ExternallyTaggedGeometryObject Class
Autodesk.Revit.DB Namespace